Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
d67ea955dcba50f2065f4490e27aa2f796a17436.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "868456335584d9c35d440d2daf2c73c1" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250730052938336300000001/builds/de75a5179759fcefb3cfb150d67ea955dcba50f2065f4490e27aa2f796a17436.zip" -> (known after apply)
      ~ key                           = "builds/de75a5179759fcefb3cfb150d67ea955dcba50f2065f4490e27aa2f796a17436.zip" -> "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/de75a5179759fcefb3cfb150d67ea955dcba50f2065f4490e27aa2f796a17436.zip" -> "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1440649368830494878" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/de75a5179759fcefb3cfb150d67ea955dcba50f2065f4490e27aa2f796a17436.zip" -> "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip"
          ~ "timestamp" = "1753853288000000000" -> "1753931279836281000"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2516d08cb985d65f30cddbee469d2a7b38c6d2f3"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:6f7b27fc53461373016efe348a55ded9755dcb3a8c9f0fd0414fa88f3e4811da" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:6f7b27fc53461373016efe348a55ded9755dcb3a8c9f0fd0414fa88f3e4811da" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "e2188c9c1416d466b2a767bab6c720d965e84db1" -> "2516d08cb985d65f30cddbee469d2a7b38c6d2f3"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1d254f1da126bf493e7a1dcd597c2e81f10838b93271dc81771a6580d26a469d.zip" -> "builds/734af28a518a31328f2a25ab6d7185fc3f3558293c5155672f983f357a0f89d8.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-07-30T06:25:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/734af28a518a31328f2a25ab6d7185fc3f3558293c5155672f983f357a0f89d8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/734af28a518a31328f2a25ab6d7185fc3f3558293c5155672f983f357a0f89d8.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8059417681603017115" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1d254f1da126bf493e7a1dcd597c2e81f10838b93271dc81771a6580d26a469d.zip" -> "builds/734af28a518a31328f2a25ab6d7185fc3f3558293c5155672f983f357a0f89d8.zip"
          ~ "timestamp" = "1753853268000000000" -> "1753931274340022000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a0657677c3733ce81dc3818688c0cb95e266d4190cc41c23b0e9ef71dcf71d95.zip" -> "builds/3b032587838c55045a97720059d4429b96aee571469fa846513b0bb1576b9ae1.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-07-30T06:27:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3b032587838c55045a97720059d4429b96aee571469fa846513b0bb1576b9ae1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3b032587838c55045a97720059d4429b96aee571469fa846513b0bb1576b9ae1.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3648690350492635061" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a0657677c3733ce81dc3818688c0cb95e266d4190cc41c23b0e9ef71dcf71d95.zip" -> "builds/3b032587838c55045a97720059d4429b96aee571469fa846513b0bb1576b9ae1.zip"
          ~ "timestamp" = "1753853270000000000" -> "1753931274849217000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5688354956005166250" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1752194676000000000" -> "1753931275157615000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3703668201699941235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694102000000000" -> "1753931275423363000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1337181045570170538" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753853270000000000" -> "1753931275132582000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8283767691838513544" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931210000000000" -> "1753931274983401000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2798464960598632037" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931210000000000" -> "1753931275865836000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6134670284610788889" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931274544355000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/f4c529d4f9df3e7bb3e03d66047692420ed230d99df04e072c41750794be45a5.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-07-30T06:05:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f4c529d4f9df3e7bb3e03d66047692420ed230d99df04e072c41750794be45a5.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f4c529d4f9df3e7bb3e03d66047692420ed230d99df04e072c41750794be45a5.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8378864572124558969" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/f4c529d4f9df3e7bb3e03d66047692420ed230d99df04e072c41750794be45a5.zip"
          ~ "timestamp" = "1751931211000000000" -> "1753931275438952000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5219521164445421053" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931275536360000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "341422105808696575" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931274623406000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "747730762173499562" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931210000000000" -> "1753931274266638000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8214787195062271427" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931211000000000" -> "1753931274538615000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7093380595958816508" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931274657874200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4270502937268014910" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694100000000000" -> "1753931275474509000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5378124947798459985" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931275744436000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "89186957165886460" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931210000000000" -> "1753931275346226000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5349518985419272950" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931275935770000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1396145596936287338" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931275325478000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3537476015167070084" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931275473476000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:6f7b27fc53461373016efe348a55ded9755dcb3a8c9f0fd0414fa88f3e4811da" -> (known after apply)
      ~ last_modified                  = "2025-07-08T00:00:20.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1414169465913975812" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931274427053000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10" -> (known after apply)
      ~ code_sha256                 = "eYST40DQ+eZaCvSx+ww7usUQo6aO17OY44xp099GUXw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-30T06:05:38.931+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/2c92591c6586a9cfc8aa96435f8b6c2f0037820fe42ef335ea068a8e8b15c14e.zip" -> "builds/a5dc6d410a38a12e9961ee7141fe093b9357b94b36af99810e37953c454c361e.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23859913 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250331043640018600000001/builds/2c92591c6586a9cfc8aa96435f8b6c2f0037820fe42ef335ea068a8e8b15c14e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "2ad0d888ccc2c3aaa81bdc18ff82dfa4-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250331043640018600000001/builds/2c92591c6586a9cfc8aa96435f8b6c2f0037820fe42ef335ea068a8e8b15c14e.zip" -> (known after apply)
      ~ key                           = "builds/2c92591c6586a9cfc8aa96435f8b6c2f0037820fe42ef335ea068a8e8b15c14e.zip" -> "builds/a5dc6d410a38a12e9961ee7141fe093b9357b94b36af99810e37953c454c361e.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/2c92591c6586a9cfc8aa96435f8b6c2f0037820fe42ef335ea068a8e8b15c14e.zip" -> "builds/a5dc6d410a38a12e9961ee7141fe093b9357b94b36af99810e37953c454c361e.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5dc6d410a38a12e9961ee7141fe093b9357b94b36af99810e37953c454c361e.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5dc6d410a38a12e9961ee7141fe093b9357b94b36af99810e37953c454c361e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3667488796989861611" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2c92591c6586a9cfc8aa96435f8b6c2f0037820fe42ef335ea068a8e8b15c14e.zip" -> "builds/a5dc6d410a38a12e9961ee7141fe093b9357b94b36af99810e37953c454c361e.zip"
          ~ "timestamp" = "1753855490000000000" -> "1753931289365980000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5" -> (known after apply)
      ~ code_sha256                 = "F8OnfVteG0nTeZ4kQ+khTONbjVYvrrYVE8o0k6zN0x4=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-07T23:40:39.991+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:5" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/22bf9a393150bbcfe6eca470ba1a8d4d00a24d027aa4a38da8fe9d11f7181e7f.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 38676 -> (known after apply)
      ~ version                     = "5" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250331043640018600000001/builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "02370aebe8fb08a9d16eb025c829ea39" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250331043640018600000001/builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> (known after apply)
      ~ key                           = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/22bf9a393150bbcfe6eca470ba1a8d4d00a24d027aa4a38da8fe9d11f7181e7f.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/22bf9a393150bbcfe6eca470ba1a8d4d00a24d027aa4a38da8fe9d11f7181e7f.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/22bf9a393150bbcfe6eca470ba1a8d4d00a24d027aa4a38da8fe9d11f7181e7f.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/22bf9a393150bbcfe6eca470ba1a8d4d00a24d027aa4a38da8fe9d11f7181e7f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4241749792799384724" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/22bf9a393150bbcfe6eca470ba1a8d4d00a24d027aa4a38da8fe9d11f7181e7f.zip"
          ~ "timestamp" = "1751931211000000000" -> "1753931274722914000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9195294621792651600" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753931274859591000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:49",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8416988470927171521" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753853289000000000" -> "1753931287634567000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:49",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5825540586845858757" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694108000000000" -> "1753931287567430000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/99d499da30f58bcebe17f865946ef40380a8ca87a0e967609143b98b80ee9a0c.zip" -> "builds/2a75f43507d2e72946748c189339e4e97d7e86cf5171ef7bdd9d2136ca2442e8.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-07-30T06:26:48.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:49",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2a75f43507d2e72946748c189339e4e97d7e86cf5171ef7bdd9d2136ca2442e8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2a75f43507d2e72946748c189339e4e97d7e86cf5171ef7bdd9d2136ca2442e8.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4733015810657616010" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/99d499da30f58bcebe17f865946ef40380a8ca87a0e967609143b98b80ee9a0c.zip" -> "builds/2a75f43507d2e72946748c189339e4e97d7e86cf5171ef7bdd9d2136ca2442e8.zip"
          ~ "timestamp" = "1753853289000000000" -> "1753931287765364800"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:49",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "198886398956472892" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753853289000000000" -> "1753931287625773000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "ec7bdfd10a73f2f2ccd20b463e9b2fbedf614c2c"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:648c66f7d722cf68b11916bb36c8581c9214ef1d4a2ddbcb4c2562e5e7866b43" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:648c66f7d722cf68b11916bb36c8581c9214ef1d4a2ddbcb4c2562e5e7866b43" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "40492a792c1a61dd055c1fdde99a08c405be1e44" -> "ec7bdfd10a73f2f2ccd20b463e9b2fbedf614c2c"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "95b0bbfe48a4043911e4e5575c886691f48afebd"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:67e7a85b671d35136830298e637838a17bfed3720663b3fa10e4d73db19acb68" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:67e7a85b671d35136830298e637838a17bfed3720663b3fa10e4d73db19acb68" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "8651e909de4a6c389b9f40531db840b47f8eac73" -> "95b0bbfe48a4043911e4e5575c886691f48afebd"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:49",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8075118962738146697" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694109000000000" -> "1753931287887075000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:648c66f7d722cf68b11916bb36c8581c9214ef1d4a2ddbcb4c2562e5e7866b43" -> (known after apply)
      ~ last_modified                  = "2025-07-30T06:29:21.740+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:49",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "575064471786567379" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753853289000000000" -> "1753931287846093800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-preprocessor"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:67e7a85b671d35136830298e637838a17bfed3720663b3fa10e4d73db19acb68" -> (known after apply)
      ~ last_modified                  = "2025-07-30T06:29:37.941+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:49",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3446138596836424874" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931219000000000" -> "1753931287946307800"
            # (1 unchanged element hidden)
        }
    }

Plan: 75 to add, 47 to change, 62 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: hub03-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "hub03-plan.out"
✅ Terraform plan created successfully: hub03-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].archive_file.binaries_layer has changed
  ~ resource "archive_file" "binaries_layer" {
        id                  = "1d0ae93c77d7ccb9bae67b8116f3fc71952a8b8a"
      ~ output_base64sha256 = "vsDZqt4l8n2n3c2EQ8wHxV5445BihJVkdTDMnyY472c=" -> "tGCSO7IkxV5HP3o1y4BT8ArA3NW0yNVmhvLU1Zi3YUE="
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_integration.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_key_parameters    = []
        id                      = "agi-6cpu5d2jyi-snbwed-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for hub03!

Thank you for using Atlantis Schema Deploy
© June, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-hub03
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-hub03
  ```

**Note: Objects have changed outside of Terraform**
Plan: 75 to add, 47 to change, 62 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```